In [11]:
import pandas as pd
data = pd.read_csv("./data/dataset_rain.csv")
# 读取前2行
data.head(2)

,Day,Month,Year,MinPressure,MaxPressure,MinVapour,MaxVapour,MinRelativeHumidity,MaxRelativeHumidity,MinTemperature,MaxTemperature,Rain,MinRadiation,MaxRadiation
0,1,1,1989,1013.9,1018.9,15.8,15.1,67,71,25.5,14.1,0.0,NaN,NaN
1,2,1,1989,1015.5,1017.5,14.3,16.5,51,77,26.3,15.0,0.0,NaN,NaN

In [13]:
# 查看形状
data.shape

(2484, 14)

In [15]:
# 查看列表名称
data.columns

Index(['Day', 'Month', 'Year', 'MinPressure', 'MaxPressure', 'MinVapour',
       'MaxVapour', 'MinRelativeHumidity', 'MaxRelativeHumidity',
       'MinTemperature', 'MaxTemperature', 'Rain', 'MinRadiation',
       'MaxRadiation'],
      dtype='object')

In [16]:
# 查看索引项
data.index

RangeIndex(start=0, stop=2484, step=1)

In [17]:
# 查看没列的数据类型
data.dtypes

Day                      int64
Month                    int64
Year                     int64
MinPressure            float64
MaxPressure            float64
MinVapour              float64
MaxVapour              float64
MinRelativeHumidity      int64
MaxRelativeHumidity      int64
MinTemperature         float64
MaxTemperature         float64
Rain                   float64
MinRadiation           float64
MaxRadiation           float64
dtype: object

DataFrame
二维数组、表格
Series一维数据

In [ ]:
import numpy as np

In [18]:
# 创建
s1 = pd.Series([1,'a',5.2,7])
s1

0      1
1      a
2    5.2
3      7
dtype: object

In [19]:
# 获取索引
s1.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
# 获取数据
s1.values

array([1, 'a', 5.2, 7], dtype=object)

In [23]:
# 创建标签索引的series
s2 = pd.Series([1,'a',5.2,7],index=['a','1','c','2'])
s2

a      1
1      a
c    5.2
2      7
dtype: object

In [24]:
# 使用字典创建
sdata = {'a':123,'b':456,'lph':'LPH','d':'哈哈哈'}
s3 = pd.Series(sdata)
s3

a      123
b      456
lph    LPH
d      哈哈哈
dtype: object

In [27]:
# 查询数据
s3['lph']
type(s3['lph'])

str

In [26]:
# 查询多个
s3[['a','lph']]

a      123
lph    LPH
dtype: object

In [ ]:
# DataFreme 行+列

In [28]:
data = {
    'A':['a','b','c','d','e'],
    'B':['1','2','3','4','5'],
    'C':[1.1,1.2,1.3,1.4,1.5]
}
df = pd.DataFrame(data)
df

   A  B    C
0  a  1  1.1
1  b  2  1.2
2  c  3  1.3
3  d  4  1.4
4  e  5  1.5

In [29]:
# 查看类型
df.dtypes

A     object
B     object
C    float64
dtype: object

In [30]:
# 列索
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [32]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [33]:
# 从DataFreame查询series
# 查询列
df['A']

0    a
1    b
2    c
3    d
4    e
Name: A, dtype: object

In [35]:
# 查询多列
df[['A','C']]

   A    C
0  a  1.1
1  b  1.2
2  c  1.3
3  d  1.4
4  e  1.5

In [36]:
# 查询一行
df.loc[1]

A      b
B      2
C    1.2
Name: 1, dtype: object

In [37]:
# 查询多行
df.loc[1:3]

   A  B    C
1  b  2  1.2
2  c  3  1.3
3  d  4  1.4

In [40]:
df

   A  B    C
0  a  1  1.1
1  b  2  1.2
2  c  3  1.3
3  d  4  1.4
4  e  5  1.5

# 查询数据

In [4]:
import pandas as pd
df = pd.read_csv('./data/dataset_rain.csv')
df.head(3)

,Day,Month,Year,MinPressure,MaxPressure,MinVapour,MaxVapour,MinRelativeHumidity,MaxRelativeHumidity,MinTemperature,MaxTemperature,Rain,MinRadiation,MaxRadiation
0,1,1,1989,1013.9,1018.9,15.8,15.1,67,71,25.5,14.1,0.0,NaN,NaN
1,2,1,1989,1015.5,1017.5,14.3,16.5,51,77,26.3,15.0,0.0,NaN,NaN
2,3,1,1989,1013.8,1017.5,15.2,16.9,57,77,26.5,13.7,0.0,NaN,NaN

In [8]:
# 设定索引
df.head(3)

,Month,Year,MinPressure,MaxPressure,MinVapour,MaxVapour,MinRelativeHumidity,MaxRelativeHumidity,MinTemperature,MaxTemperature,Rain,MinRadiation,MaxRadiation
Day,,,,,,,,,,,,,
1,1,1989,1013.9,1018.9,15.8,15.1,67,71,25.5,14.1,0.0,NaN,NaN
2,1,1989,1015.5,1017.5,14.3,16.5,51,77,26.3,15.0,0.0,NaN,NaN
3,1,1989,1013.8,1017.5,15.2,16.9,57,77,26.5,13.7,0.0,NaN,NaN

In [32]:

df2 = pd.read_csv("./data/test2.csv")
df2.head(3)

       data   regin    sum
0  1-1-2021  regin1  0.5cc
1  1-2-2021  regin2  0.3cc
2  1-3-2021  regin3  0.2cc

In [33]:
# 替换小数点字符
df2.loc[:,"sum"] = df2["sum"].str.replace("cc","").astype("float")
df2.dtypes

data      object
regin     object
sum      float64
dtype: object

In [9]:
df2.head()

NameError: name 'df2' is not defined

In [19]:
import pandas as pd
data = pd.read_csv("./data/test2.csv")
data.set_index("data", inplace=True)

print(data.index)
print(data.loc[1001,"sum"])

Int64Index([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009], dtype='int64', name='data')

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given